/* automatically generated by rust-bindgen 0.69.4 */

#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct SpvId(pub ::std::os::raw::c_uint);
#[repr(i32)]
#[derive(
    Debug, Copy, Clone, Hash, PartialEq, Eq, num_derive :: FromPrimitive, num_derive :: ToPrimitive,
)]
pub enum SpvSourceLanguage {
    Unknown = 0,
    ESSL = 1,
    GLSL = 2,
    OpenCL_C = 3,
    OpenCL_CPP = 4,
    HLSL = 5,
    CPP_for_OpenCL = 6,
    SYCL = 7,
}
impl SpvExecutionModel {
    pub const RayGenerationNV: SpvExecutionModel = SpvExecutionModel::RayGenerationKHR;
}
impl SpvExecutionModel {
    pub const IntersectionNV: SpvExecutionModel = SpvExecutionModel::IntersectionKHR;
}
impl SpvExecutionModel {
    pub const AnyHitNV: SpvExecutionModel = SpvExecutionModel::AnyHitKHR;
}
impl SpvExecutionModel {
    pub const ClosestHitNV: SpvExecutionModel = SpvExecutionModel::ClosestHitKHR;
}
impl SpvExecutionModel {
    pub const MissNV: SpvExecutionModel = SpvExecutionModel::MissKHR;
}
impl SpvExecutionModel {
    pub const CallableNV: SpvExecutionModel = SpvExecutionModel::CallableKHR;
}
#[repr(i32)]
#[derive(
    Debug, Copy, Clone, Hash, PartialEq, Eq, num_derive :: FromPrimitive, num_derive :: ToPrimitive,
)]
pub enum SpvExecutionModel {
    Vertex = 0,
    TessellationControl = 1,
    TessellationEvaluation = 2,
    Geometry = 3,
    Fragment = 4,
    GLCompute = 5,
    Kernel = 6,
    TaskNV = 5267,
    MeshNV = 5268,
    RayGenerationKHR = 5313,

    RayQueryGetIntersectionObjectRayOriginKHR = 6028,
    RayQueryGetWorldRayDirectionKHR = 6029,
    RayQueryGetWorldRayOriginKHR = 6030,
    RayQueryGetIntersectionObjectToWorldKHR = 6031,
    RayQueryGetIntersectionWorldToObjectKHR = 6032,
    AtomicFAddEXT = 6035,
    TypeBufferSurfaceINTEL = 6086,
    TypeStructContinuedINTEL = 6090,
    ConstantCompositeContinuedINTEL = 6091,
    SpecConstantCompositeContinuedINTEL = 6092,
    ControlBarrierArriveINTEL = 6142,
    ControlBarrierWaitINTEL = 6143,
    GroupIMulKHR = 6401,
    GroupFMulKHR = 6402,
    GroupBitwiseAndKHR = 6403,
    GroupBitwiseOrKHR = 6404,
    GroupBitwiseXorKHR = 6405,
    GroupLogicalAndKHR = 6406,
    GroupLogicalOrKHR = 6407,
    GroupLogicalXorKHR = 6408,
}
extern "C" {
    pub fn spvc_get_version(
        major: *mut ::std::os::raw::c_uint,
        minor: *mut ::std::os::raw::c_uint,
        patch: *mut ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn spvc_get_commit_revision_and_timestamp() -> *const ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct spvc_context_s {
    _unused: [u8; 0],
}
pub type spvc_context = *mut spvc_context_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct spvc_parsed_ir_s {
    _unused: [u8; 0],
}
pub type spvc_parsed_ir = *mut spvc_parsed_ir_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct spvc_compiler_s {
    _unused: [u8; 0],
}
pub type spvc_compiler = *mut spvc_compiler_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct spvc_compiler_options_s {
    _unused: [u8; 0],
}
pub type spvc_compiler_options = *mut spvc_compiler_options_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct spvc_resources_s {
    _unused: [u8; 0],
}
pub type spvc_resources = *mut spvc_resources_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct spvc_type_s {
    _unused: [u8; 0],
}
pub type spvc_type = *const spvc_type_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct spvc_constant_s {
    _unused: [u8; 0],
}
pub type spvc_constant = *mut spvc_constant_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct spvc_set_s {
    _unused: [u8; 0],
}
pub type spvc_set = *const spvc_set_s;
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct TypeId(pub SpvId);
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct VariableId(pub SpvId);
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct ConstantId(pub SpvId);
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct spvc_reflected_resource {
    pub id: VariableId,
    pub base_type_id: TypeId,
    pub type_id: TypeId,
    pub name: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_spvc_reflected_resource() {
    const UNINIT: ::std::mem::MaybeUninit<spvc_reflected_resource> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<spvc_reflected_resource>(),
        24usize,
        concat!("Size of: ", stringify!(spvc_reflected_resource))
    );
    assert_eq!(
        ::std::mem::align_of::<spvc_reflected_resource>(),
        8usize,
        concat!("Alignment of ", stringify!(spvc_reflected_resource))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).id) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_reflected_resource),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).base_type_id) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_reflected_resource),
            "::",
            stringify!(base_type_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_id) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_reflected_resource),
            "::",
            stringify!(type_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_reflected_resource),
            "::",
            stringify!(name)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct spvc_reflected_builtin_resource {
    pub builtin: SpvBuiltIn,
    pub value_type_id: TypeId,
    pub resource: spvc_reflected_resource,
}
#[test]
fn bindgen_test_layout_spvc_reflected_builtin_resource() {
    const UNINIT: ::std::mem::MaybeUninit<spvc_reflected_builtin_resource> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<spvc_reflected_builtin_resource>(),
        32usize,
        concat!("Size of: ", stringify!(spvc_reflected_builtin_resource))
    );
    assert_eq!(
        ::std::mem::align_of::<spvc_reflected_builtin_resource>(),
        8usize,
        concat!("Alignment of ", stringify!(spvc_reflected_builtin_resource))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).builtin) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_reflected_builtin_resource),
            "::",
            stringify!(builtin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).value_type_id) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_reflected_builtin_resource),
            "::",
            stringify!(value_type_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).resource) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_reflected_builtin_resource),
            "::",
            stringify!(resource)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct spvc_entry_point {
    pub execution_model: SpvExecutionModel,
    pub name: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_spvc_entry_point() {
    const UNINIT: ::std::mem::MaybeUninit<spvc_entry_point> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<spvc_entry_point>(),
        16usize,
        concat!("Size of: ", stringify!(spvc_entry_point))
    );
    assert_eq!(
        ::std::mem::align_of::<spvc_entry_point>(),
        8usize,
        concat!("Alignment of ", stringify!(spvc_entry_point))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).execution_model) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_entry_point),
            "::",
            stringify!(execution_model)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_entry_point),
            "::",
            stringify!(name)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct spvc_combined_image_sampler {
    pub combined_id: VariableId,
    pub image_id: VariableId,
    pub sampler_id: VariableId,
}
#[test]
fn bindgen_test_layout_spvc_combined_image_sampler() {
    const UNINIT: ::std::mem::MaybeUninit<spvc_combined_image_sampler> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<spvc_combined_image_sampler>(),
        12usize,
        concat!("Size of: ", stringify!(spvc_combined_image_sampler))
    );
    assert_eq!(
        ::std::mem::align_of::<spvc_combined_image_sampler>(),
        4usize,
        concat!("Alignment of ", stringify!(spvc_combined_image_sampler))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).combined_id) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_combined_image_sampler),
            "::",
            stringify!(combined_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).image_id) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_combined_image_sampler),
            "::",
            stringify!(image_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sampler_id) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_combined_image_sampler),
            "::",
            stringify!(sampler_id)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct spvc_specialization_constant {
    pub id: ConstantId,
    pub constant_id: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_spvc_specialization_constant() {
    const UNINIT: ::std::mem::MaybeUninit<spvc_specialization_constant> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<spvc_specialization_constant>(),
        8usize,
        concat!("Size of: ", stringify!(spvc_specialization_constant))
    );
    assert_eq!(
        ::std::mem::align_of::<spvc_specialization_constant>(),
        4usize,
        concat!("Alignment of ", stringify!(spvc_specialization_constant))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).id) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_specialization_constant),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).constant_id) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_specialization_constant),
            "::",
            stringify!(constant_id)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct BufferRange {
    pub index: ::std::os::raw::c_uint,
    pub offset: usize,
    pub range: usize,
}
#[test]
fn bindgen_test_layout_BufferRange() {
    const UNINIT: ::std::mem::MaybeUninit<BufferRange> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BufferRange>(),
        24usize,
        concat!("Size of: ", stringify!(BufferRange))
    );
    assert_eq!(
        ::std::mem::align_of::<BufferRange>(),
        8usize,
        concat!("Alignment of ", stringify!(BufferRange))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).index) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BufferRange),
            "::",
            stringify!(index)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).offset) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BufferRange),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).range) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BufferRange),
            "::",
            stringify!(range)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct HlslRootConstants {
    pub start: ::std::os::raw::c_uint,
    pub end: ::std::os::raw::c_uint,
    pub binding: ::std::os::raw::c_uint,
    pub space: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_HlslRootConstants() {
    const UNINIT: ::std::mem::MaybeUninit<HlslRootConstants> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<HlslRootConstants>(),
        16usize,
        concat!("Size of: ", stringify!(HlslRootConstants))
    );
    assert_eq!(
        ::std::mem::align_of::<HlslRootConstants>(),
        4usize,
        concat!("Alignment of ", stringify!(HlslRootConstants))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).start) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(HlslRootConstants),
            "::",
            stringify!(start)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).end) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(HlslRootConstants),
            "::",
            stringify!(end)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).binding) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(HlslRootConstants),
            "::",
            stringify!(binding)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).space) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(HlslRootConstants),
            "::",
            stringify!(space)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct HlslVertexAttributeRemap {
    pub location: ::std::os::raw::c_uint,
    pub semantic: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_HlslVertexAttributeRemap() {
    const UNINIT: ::std::mem::MaybeUninit<HlslVertexAttributeRemap> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<HlslVertexAttributeRemap>(),
        16usize,
        concat!("Size of: ", stringify!(HlslVertexAttributeRemap))
    );
    assert_eq!(
        ::std::mem::align_of::<HlslVertexAttributeRemap>(),
        8usize,
        concat!("Alignment of ", stringify!(HlslVertexAttributeRemap))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).location) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(HlslVertexAttributeRemap),
            "::",
            stringify!(location)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).semantic) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(HlslVertexAttributeRemap),
            "::",
            stringify!(semantic)
        )
    );
}
#[repr(i32)]
#[must_use]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum spvc_result {
    SPVC_SUCCESS = 0,
    SPVC_ERROR_INVALID_SPIRV = -1,
    SPVC_ERROR_UNSUPPORTED_SPIRV = -2,
    SPVC_ERROR_OUT_OF_MEMORY = -3,
    SPVC_ERROR_INVALID_ARGUMENT = -4,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum spvc_capture_mode {
    Copy = 0,
    TakeOwnership = 1,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum CompilerBackend {
    None = 0,
    Glsl = 1,
    Hlsl = 2,
    Msl = 3,
    Cpp = 4,
    Json = 5,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ResourceType {
    Unknown = 0,
    UniformBuffer = 1,
    StorageBuffer = 2,
    StageInput = 3,
    StageOutput = 4,
    SubpassInput = 5,
    StorageImage = 6,
    SampledImage = 7,
    AtomicCounter = 8,
    PushConstant = 9,
    SeparateImage = 10,
    SeparateSamplers = 11,
    AccelerationStructure = 12,
    RayQuery = 13,
    ShaderRecordBuffer = 14,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BuiltinResourceType {
    Unknown = 0,
    StageInput = 1,
    StageOutput = 2,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BaseType {
    Unknown = 0,
    Void = 1,
    Boolean = 2,
    Int8 = 3,
    Uint8 = 4,
    Int16 = 5,
    Uint16 = 6,
    Int32 = 7,
    Uint32 = 8,
    Int64 = 9,
    Uint64 = 10,
    AtomicCounter = 11,
    Fp16 = 12,
    Fp32 = 13,
    Fp64 = 14,
    Struct = 15,
    Image = 16,
    SampledImage = 17,
    Sampler = 18,
    AccelerationStructure = 19,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum MslPlatform {
    Ios = 0,
    Macos = 1,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum MslIndexType {
    None = 0,
    Uint16 = 1,
    Uint32 = 2,
}
impl MslShaderVariableFormat {
    pub const SPVC_MSL_VERTEX_FORMAT_OTHER: MslShaderVariableFormat =
        MslShaderVariableFormat::Other;
}
impl MslShaderVariableFormat {
    pub const SPVC_MSL_VERTEX_FORMAT_UINT8: MslShaderVariableFormat =
        MslShaderVariableFormat::Uint8;
}
impl MslShaderVariableFormat {
    pub const SPVC_MSL_VERTEX_FORMAT_UINT16: MslShaderVariableFormat =
        MslShaderVariableFormat::Uint16;
}
impl MslShaderVariableFormat {
    pub const SPVC_MSL_SHADER_INPUT_FORMAT_OTHER: MslShaderVariableFormat =
        MslShaderVariableFormat::Other;
}
impl MslShaderVariableFormat {
    pub const SPVC_MSL_SHADER_INPUT_FORMAT_UINT8: MslShaderVariableFormat =
        MslShaderVariableFormat::Uint8;
}
impl MslShaderVariableFormat {
    pub const SPVC_MSL_SHADER_INPUT_FORMAT_UINT16: MslShaderVariableFormat =
        MslShaderVariableFormat::Uint16;
}
impl MslShaderVariableFormat {
    pub const SPVC_MSL_SHADER_INPUT_FORMAT_ANY16: MslShaderVariableFormat =
        MslShaderVariableFormat::Any16;
}
impl MslShaderVariableFormat {
    pub const SPVC_MSL_SHADER_INPUT_FORMAT_ANY32: MslShaderVariableFormat =
        MslShaderVariableFormat::Any32;
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum MslShaderVariableFormat {
    Other = 0,
    Uint8 = 1,
    Uint16 = 2,
    Any16 = 3,
    Any32 = 4,
}
pub use self::MslShaderVariableFormat as MslShaderInputFormat;
pub use self::MslShaderVariableFormat as MslVertexFormat;
#[repr(C)]
pub struct MslVertexAttribute {
    pub location: ::std::os::raw::c_uint,
    pub msl_buffer: ::std::os::raw::c_uint,
    pub msl_offset: ::std::os::raw::c_uint,
    pub msl_stride: ::std::os::raw::c_uint,
    pub per_instance: crate::spvc_bool,
    pub format: MslVertexFormat,
    pub builtin: SpvBuiltIn,
}
#[test]
fn bindgen_test_layout_MslVertexAttribute() {
    const UNINIT: ::std::mem::MaybeUninit<MslVertexAttribute> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<MslVertexAttribute>(),
        28usize,
        concat!("Size of: ", stringify!(MslVertexAttribute))
    );
    assert_eq!(
        ::std::mem::align_of::<MslVertexAttribute>(),
        4usize,
        concat!("Alignment of ", stringify!(MslVertexAttribute))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).location) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MslVertexAttribute),
            "::",
            stringify!(location)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msl_buffer) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(MslVertexAttribute),
            "::",
            stringify!(msl_buffer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msl_offset) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(MslVertexAttribute),
            "::",
            stringify!(msl_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msl_stride) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(MslVertexAttribute),
            "::",
            stringify!(msl_stride)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).per_instance) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(MslVertexAttribute),
            "::",
            stringify!(per_instance)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(MslVertexAttribute),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).builtin) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(MslVertexAttribute),
            "::",
            stringify!(builtin)
        )
    );
}
extern "C" {
    pub fn spvc_msl_vertex_attribute_init(attr: *mut MslVertexAttribute);
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct MslShaderInterfaceVar {
    pub location: ::std::os::raw::c_uint,
    pub format: MslVertexFormat,
    pub builtin: SpvBuiltIn,
    pub vecsize: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_MslShaderInterfaceVar() {
    const UNINIT: ::std::mem::MaybeUninit<MslShaderInterfaceVar> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<MslShaderInterfaceVar>(),
        16usize,
        concat!("Size of: ", stringify!(MslShaderInterfaceVar))
    );
    assert_eq!(
        ::std::mem::align_of::<MslShaderInterfaceVar>(),
        4usize,
        concat!("Alignment of ", stringify!(MslShaderInterfaceVar))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).location) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MslShaderInterfaceVar),
            "::",
            stringify!(location)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(MslShaderInterfaceVar),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).builtin) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(MslShaderInterfaceVar),
            "::",
            stringify!(builtin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vecsize) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(MslShaderInterfaceVar),
            "::",
            stringify!(vecsize)
        )
    );
}
pub type MslShaderInput = MslShaderInterfaceVar;
extern "C" {
    pub fn spvc_msl_shader_interface_var_init(var: *mut MslShaderInterfaceVar);
}
extern "C" {
    pub fn spvc_msl_shader_input_init(input: *mut MslShaderInput);
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum MslShaderVariableRate {
    PerVertex = 0,
    PerPrimitive = 1,
    PerPatch = 2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct MslShaderInterfaceVar2 {
    pub location: ::std::os::raw::c_uint,
    pub format: MslShaderVariableFormat,
    pub builtin: SpvBuiltIn,
    pub vecsize: ::std::os::raw::c_uint,
    pub rate: MslShaderVariableRate,
}
#[test]
fn bindgen_test_layout_MslShaderInterfaceVar2() {
    const UNINIT: ::std::mem::MaybeUninit<MslShaderInterfaceVar2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<MslShaderInterfaceVar2>(),
        20usize,
        concat!("Size of: ", stringify!(MslShaderInterfaceVar2))
    );
    assert_eq!(
        ::std::mem::align_of::<MslShaderInterfaceVar2>(),
        4usize,
        concat!("Alignment of ", stringify!(MslShaderInterfaceVar2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).location) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MslShaderInterfaceVar2),
            "::",
            stringify!(location)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(MslShaderInterfaceVar2),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).builtin) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(MslShaderInterfaceVar2),
            "::",
            stringify!(builtin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vecsize) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(MslShaderInterfaceVar2),
            "::",
            stringify!(vecsize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rate) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(MslShaderInterfaceVar2),
            "::",
            stringify!(rate)
        )
    );
}
extern "C" {
    pub fn spvc_msl_shader_interface_var_init_2(var: *mut MslShaderInterfaceVar2);
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct MslResourceBinding {
    pub stage: SpvExecutionModel,
    pub desc_set: ::std::os::raw::c_uint,
    pub binding: ::std::os::raw::c_uint,
    pub msl_buffer: ::std::os::raw::c_uint,
    pub msl_texture: ::std::os::raw::c_uint,
    pub msl_sampler: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_MslResourceBinding() {
    const UNINIT: ::std::mem::MaybeUninit<MslResourceBinding> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<MslResourceBinding>(),
        24usize,
        concat!("Size of: ", stringify!(MslResourceBinding))
    );
    assert_eq!(
        ::std::mem::align_of::<MslResourceBinding>(),
        4usize,
        concat!("Alignment of ", stringify!(MslResourceBinding))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stage) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MslResourceBinding),
            "::",
            stringify!(stage)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).desc_set) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(MslResourceBinding),
            "::",
            stringify!(desc_set)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).binding) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(MslResourceBinding),
            "::",
            stringify!(binding)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msl_buffer) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(MslResourceBinding),
            "::",
            stringify!(msl_buffer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msl_texture) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(MslResourceBinding),
            "::",
            stringify!(msl_texture)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msl_sampler) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(MslResourceBinding),
            "::",
            stringify!(msl_sampler)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct MslResourceBinding2 {
    pub stage: SpvExecutionModel,
    pub desc_set: ::std::os::raw::c_uint,
    pub binding: ::std::os::raw::c_uint,
    pub count: ::std::os::raw::c_uint,
    pub msl_buffer: ::std::os::raw::c_uint,
    pub msl_texture: ::std::os::raw::c_uint,
    pub msl_sampler: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_MslResourceBinding2() {
    const UNINIT: ::std::mem::MaybeUninit<MslResourceBinding2> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<MslResourceBinding2>(),
        28usize,
        concat!("Size of: ", stringify!(MslResourceBinding2))
    );
    assert_eq!(
        ::std::mem::align_of::<MslResourceBinding2>(),
        4usize,
        concat!("Alignment of ", stringify!(MslResourceBinding2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stage) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MslResourceBinding2),
            "::",
            stringify!(stage)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).desc_set) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(MslResourceBinding2),
            "::",
            stringify!(desc_set)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).binding) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(MslResourceBinding2),
            "::",
            stringify!(binding)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).count) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(MslResourceBinding2),
            "::",
            stringify!(count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msl_buffer) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(MslResourceBinding2),
            "::",
            stringify!(msl_buffer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msl_texture) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(MslResourceBinding2),
            "::",
            stringify!(msl_texture)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msl_sampler) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(MslResourceBinding2),
            "::",
            stringify!(msl_sampler)
        )
    );
}
extern "C" {
    pub fn spvc_msl_resource_binding_init(binding: *mut MslResourceBinding);
}
extern "C" {
    pub fn spvc_msl_resource_binding_init_2(binding: *mut MslResourceBinding2);
}
extern "C" {
    pub fn spvc_msl_get_aux_buffer_struct_version() -> ::std::os::raw::c_uint;
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum MslSamplerCoord {
    Normalized = 0,
    Pixel = 1,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum MslSamplerFilter {
    Nearest = 0,
    Linear = 1,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum MslSamplerMipFilter {
    None = 0,
    Nearest = 1,
    Linear = 2,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum MslSamplerAddress {
    ClampToZero = 0,
    ClampToEdge = 1,
    ClampToBorder = 2,
    Repeat = 3,
    MirroredRepeat = 4,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum MslSamplerCompareFunc {
    Never = 0,
    Less = 1,
    LessEqual = 2,
    Greater = 3,
    GreaterEqual = 4,
    Equal = 5,
    NotEqual = 6,
    Always = 7,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum MslSamplerBorderColor {
    TransparentBlack = 0,
    OpaqueBlack = 1,
    OpaqueWhite = 2,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum MslFormatResolution {
    FormatResolution444 = 0,
    FormatResolution422 = 1,
    FormatResolution420 = 2,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum MslChromaLocation {
    CositedEven = 0,
    Midpoint = 1,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum MslComponentSwizzle {
    Identity = 0,
    Zero = 1,
    One = 2,
    R = 3,
    G = 4,
    B = 5,
    A = 6,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum MslSamplerYcbcrModelConversion {
    RgbIdentity = 0,
    YcbcrIdentity = 1,
    YcbcrBt709 = 2,
    YcbcrBt601 = 3,
    YcbcrBt2020 = 4,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum MslSamplerYcbcrRange {
    ItuFull = 0,
    ItuNarrow = 1,
}
#[repr(C)]
pub struct MslConstexprSampler {
    pub coord: MslSamplerCoord,
    pub min_filter: MslSamplerFilter,
    pub mag_filter: MslSamplerFilter,
    pub mip_filter: MslSamplerMipFilter,
    pub s_address: MslSamplerAddress,
    pub t_address: MslSamplerAddress,
    pub r_address: MslSamplerAddress,
    pub compare_func: MslSamplerCompareFunc,
    pub border_color: MslSamplerBorderColor,
    pub lod_clamp_min: f32,
    pub lod_clamp_max: f32,
    pub max_anisotropy: ::std::os::raw::c_int,
    pub compare_enable: crate::spvc_bool,
    pub lod_clamp_enable: crate::spvc_bool,
    pub anisotropy_enable: crate::spvc_bool,
}
#[test]
fn bindgen_test_layout_MslConstexprSampler() {
    const UNINIT: ::std::mem::MaybeUninit<MslConstexprSampler> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<MslConstexprSampler>(),
        52usize,
        concat!("Size of: ", stringify!(MslConstexprSampler))
    );
    assert_eq!(
        ::std::mem::align_of::<MslConstexprSampler>(),
        4usize,
        concat!("Alignment of ", stringify!(MslConstexprSampler))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).coord) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MslConstexprSampler),
            "::",
            stringify!(coord)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).min_filter) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(MslConstexprSampler),
            "::",
            stringify!(min_filter)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mag_filter) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(MslConstexprSampler),
            "::",
            stringify!(mag_filter)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mip_filter) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(MslConstexprSampler),
            "::",
            stringify!(mip_filter)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s_address) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(MslConstexprSampler),
            "::",
            stringify!(s_address)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).t_address) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(MslConstexprSampler),
            "::",
            stringify!(t_address)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).r_address) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(MslConstexprSampler),
            "::",
            stringify!(r_address)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).compare_func) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(MslConstexprSampler),
            "::",
            stringify!(compare_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).border_color) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(MslConstexprSampler),
            "::",
            stringify!(border_color)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lod_clamp_min) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(MslConstexprSampler),
            "::",
            stringify!(lod_clamp_min)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lod_clamp_max) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(MslConstexprSampler),
            "::",
            stringify!(lod_clamp_max)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_anisotropy) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(MslConstexprSampler),
            "::",
            stringify!(max_anisotropy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).compare_enable) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(MslConstexprSampler),
            "::",
            stringify!(compare_enable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lod_clamp_enable) as usize - ptr as usize },
        49usize,
        concat!(
            "Offset of field: ",
            stringify!(MslConstexprSampler),
            "::",
            stringify!(lod_clamp_enable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).anisotropy_enable) as usize - ptr as usize },
        50usize,
        concat!(
            "Offset of field: ",
            stringify!(MslConstexprSampler),
            "::",
            stringify!(anisotropy_enable)
        )
    );
}
extern "C" {
    pub fn spvc_msl_constexpr_sampler_init(sampler: *mut MslConstexprSampler);
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct MslSamplerYcbcrConversion {
    pub planes: ::std::os::raw::c_uint,
    pub resolution: MslFormatResolution,
    pub chroma_filter: MslSamplerFilter,
    pub x_chroma_offset: MslChromaLocation,
    pub y_chroma_offset: MslChromaLocation,
    pub swizzle: [MslComponentSwizzle; 4usize],
    pub ycbcr_model: MslSamplerYcbcrModelConversion,
    pub ycbcr_range: MslSamplerYcbcrRange,
    pub bpc: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_MslSamplerYcbcrConversion() {
    const UNINIT: ::std::mem::MaybeUninit<MslSamplerYcbcrConversion> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<MslSamplerYcbcrConversion>(),
        48usize,
        concat!("Size of: ", stringify!(MslSamplerYcbcrConversion))
    );
    assert_eq!(
        ::std::mem::align_of::<MslSamplerYcbcrConversion>(),
        4usize,
        concat!("Alignment of ", stringify!(MslSamplerYcbcrConversion))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).planes) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MslSamplerYcbcrConversion),
            "::",
            stringify!(planes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).resolution) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(MslSamplerYcbcrConversion),
            "::",
            stringify!(resolution)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).chroma_filter) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(MslSamplerYcbcrConversion),
            "::",
            stringify!(chroma_filter)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x_chroma_offset) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(MslSamplerYcbcrConversion),
            "::",
            stringify!(x_chroma_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y_chroma_offset) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(MslSamplerYcbcrConversion),
            "::",
            stringify!(y_chroma_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).swizzle) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(MslSamplerYcbcrConversion),
            "::",
            stringify!(swizzle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ycbcr_model) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(MslSamplerYcbcrConversion),
            "::",
            stringify!(ycbcr_model)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ycbcr_range) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(MslSamplerYcbcrConversion),
            "::",
            stringify!(ycbcr_range)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bpc) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(MslSamplerYcbcrConversion),
            "::",
            stringify!(bpc)
        )
    );
}
extern "C" {
    pub fn spvc_msl_sampler_ycbcr_conversion_init(conv: *mut MslSamplerYcbcrConversion);
}
impl HlslBindingFlagBits {
    pub const SPVC_HLSL_BINDING_AUTO_NONE_BIT: HlslBindingFlagBits = HlslBindingFlagBits(0);
}
impl HlslBindingFlagBits {
    pub const SPVC_HLSL_BINDING_AUTO_PUSH_CONSTANT_BIT: HlslBindingFlagBits =
        HlslBindingFlagBits(1);
}
impl HlslBindingFlagBits {
    pub const SPVC_HLSL_BINDING_AUTO_CBV_BIT: HlslBindingFlagBits = HlslBindingFlagBits(2);
}
impl HlslBindingFlagBits {
    pub const SPVC_HLSL_BINDING_AUTO_SRV_BIT: HlslBindingFlagBits = HlslBindingFlagBits(4);
}
impl HlslBindingFlagBits {
    pub const SPVC_HLSL_BINDING_AUTO_UAV_BIT: HlslBindingFlagBits = HlslBindingFlagBits(8);
}
impl HlslBindingFlagBits {
    pub const SPVC_HLSL_BINDING_AUTO_SAMPLER_BIT: HlslBindingFlagBits = HlslBindingFlagBits(16);
}
impl HlslBindingFlagBits {
    pub const SPVC_HLSL_BINDING_AUTO_ALL: HlslBindingFlagBits = HlslBindingFlagBits(2147483647);
}
impl ::std::ops::BitOr<HlslBindingFlagBits> for HlslBindingFlagBits {
    type Output = Self;
    #[inline]
    fn bitor(self, other: Self) -> Self {
        HlslBindingFlagBits(self.0 | other.0)
    }
}
impl ::std::ops::BitOrAssign for HlslBindingFlagBits {
    #[inline]
    fn bitor_assign(&mut self, rhs: HlslBindingFlagBits) {
        self.0 |= rhs.0;
    }
}
impl ::std::ops::BitAnd<HlslBindingFlagBits> for HlslBindingFlagBits {
    type Output = Self;
    #[inline]
    fn bitand(self, other: Self) -> Self {
        HlslBindingFlagBits(self.0 & other.0)
    }
}
impl ::std::ops::BitAndAssign for HlslBindingFlagBits {
    #[inline]
    fn bitand_assign(&mut self, rhs: HlslBindingFlagBits) {
        self.0 &= rhs.0;
    }
}
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct HlslBindingFlagBits(pub ::std::os::raw::c_int);
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct HlslBindingFlags(pub ::std::os::raw::c_uint);
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct HlslResourceBindingMapping {
    pub register_space: ::std::os::raw::c_uint,
    pub register_binding: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_HlslResourceBindingMapping() {
    const UNINIT: ::std::mem::MaybeUninit<HlslResourceBindingMapping> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<HlslResourceBindingMapping>(),
        8usize,
        concat!("Size of: ", stringify!(HlslResourceBindingMapping))
    );
    assert_eq!(
        ::std::mem::align_of::<HlslResourceBindingMapping>(),
        4usize,
        concat!("Alignment of ", stringify!(HlslResourceBindingMapping))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).register_space) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(HlslResourceBindingMapping),
            "::",
            stringify!(register_space)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).register_binding) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(HlslResourceBindingMapping),
            "::",
            stringify!(register_binding)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct HlslResourceBinding {
    pub stage: SpvExecutionModel,
    pub desc_set: ::std::os::raw::c_uint,
    pub binding: ::std::os::raw::c_uint,
    pub cbv: HlslResourceBindingMapping,
    pub uav: HlslResourceBindingMapping,
    pub srv: HlslResourceBindingMapping,
    pub sampler: HlslResourceBindingMapping,
}
#[test]
fn bindgen_test_layout_HlslResourceBinding() {
    const UNINIT: ::std::mem::MaybeUninit<HlslResourceBinding> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<HlslResourceBinding>(),
        44usize,
        concat!("Size of: ", stringify!(HlslResourceBinding))
    );
    assert_eq!(
        ::std::mem::align_of::<HlslResourceBinding>(),
        4usize,
        concat!("Alignment of ", stringify!(HlslResourceBinding))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stage) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(HlslResourceBinding),
            "::",
            stringify!(stage)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).desc_set) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(HlslResourceBinding),
            "::",
            stringify!(desc_set)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).binding) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(HlslResourceBinding),
            "::",
            stringify!(binding)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cbv) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(HlslResourceBinding),
            "::",
            stringify!(cbv)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uav) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(HlslResourceBinding),
            "::",
            stringify!(uav)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).srv) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(HlslResourceBinding),
            "::",
            stringify!(srv)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sampler) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(HlslResourceBinding),
            "::",
            stringify!(sampler)
        )
    );
}
extern "C" {
    pub fn spvc_hlsl_resource_binding_init(binding: *mut HlslResourceBinding);
}
impl spvc_compiler_option {
    pub const Unknown: spvc_compiler_option = spvc_compiler_option(0);
}
impl spvc_compiler_option {
    pub const ForceTemporary: spvc_compiler_option = spvc_compiler_option(16777217);
}
impl spvc_compiler_option {
    pub const FlattenMultidimensionalArrays: spvc_compiler_option = spvc_compiler_option(16777218);
}
impl spvc_compiler_option {
    pub const FixupDepthConvention: spvc_compiler_option = spvc_compiler_option(16777219);
}
impl spvc_compiler_option {
    pub const FlipVertexY: spvc_compiler_option = spvc_compiler_option(16777220);
}
impl spvc_compiler_option {
    pub const GlslSupportNonzeroBaseInstance: spvc_compiler_option = spvc_compiler_option(33554437);
}
impl spvc_compiler_option {
